[{
    "year": "2003",
    "story": "I played Warcraft 3 custom games every morning before school in the 7th and 8th grades. In the evenings I learned how to program JASS to make my own maps."
}, {
    "year": "2004",
    "story": "I took my first offical programming class at Southridge High School.  I learned VB.NET from an incredible teacher, who would end up hiring me to redesign and develop the school's website.",
    "elsewhere": "My dad purchased my first guitar and amplifier. I was hooked immediately and spent this next couple years recording myself in a feedback loop of learning."
}, {
    "year": "2005",
    "story": "I built my first website fontend after seeing a presentation on pseudo-selectors and their use in interactive design.  This was my first time delving into interactivity."
}, {
    "year": "2006",
    "story": "I started studying C++ on my own using my teacher as resource of unlimited knowledge.",
    "elsewhere": "I bought my first drumset from a friend for $250; I immediately dismantled it, disliking the color.  I wanted it to be sparkly blue with a racing stripe, like a <a href=\"http://photos.ecarlist.com/Ub/hO/ti/BR/hu/cz/0N/T3/Kg/wz/jA_800.jpg\">Shelby Cobra</a>, so my dad taught me how to paint and we made it so.  "
}, {
    "year": "2007",
    "story": "Designed and programmed my first blog from scratch.  It was pastel and dark gray, using grunge and noise; looking back, it was not very good looking, but it worked well."
}, {
    "year": "2008",
    "story": "I barely graduated from High School.  I was spending of my time engrossed in my computer; I was learning to push the boundaries of interaction with JavaScript and use my love for Minimalism and Art Deco geometry in design.",
    "elsewhere": "I released my first album of music, which I had been working on since I picked up my first guitar."
}, {
    "year": "2009",
    "story": "I studied Jazz composition by a Saxophonist that had clearly snorted a stream of cocaine in his younger days and had followed it with years of cigarettes and martinis.",
    "elsewhere": "I played a show at the Hawethorne Theatre, in Portland, where I wrote 30 minutes of music from scratch in 30 days.  To say it went bad would be an understatement, but the music was cool."
}, {
    "year": "2011",
    "story": "After wandering through life the previous year, making art and music, I returned to creating impeccable code and functional, beautiful design.  I started to study the psychology of shapes, colors and words on how people interact with interfaces."
}, {
    "year": "2012",
    "story": "I sent out seven applications to web companies around Portland, Oregon. After a strange, strange interview at Webtrends that included a bottle of Mirror Pond Ale, I started as the Interactive Designer in their newly forming Digital Intelligence Lab.",
    "elsewhere": "I backpacked around Hetch Hetchy Reservoir with my sister.  The last night caping the trip off, eating surf and turf in the middle on the forrest, with strangers who had offered us beers before saying hello."
}, {
    "year": "2013",
    "story": "Decided to change things up, leaving my position at Webtrends to freelance around Portland.  I am currently looking to work alongside talented, forward-thinkers in the Bay Area.",
    "elsewhere": "I spent a lot of time at concerts and festivals with my good friend over the summer, the final tally sitting around 20-30 bands in three months."
}, {
    "year": "2014",
    "story": "I can not see into the future yet, unfortunately, but I will be living in San Franscico making awesome products." 
}]